Процедура ЗаполнитьТаблицуРолей() Экспорт
	
	Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
	
	СписокПрав.Очистить();
	
	НаборПрав = Метаданные.Роли;
	
	Для Каждого Роль Из НаборПрав Цикл
		СтрокаРоли = СписокПрав.Добавить();
		СтрокаРоли.ИмяРоли = Роль.Имя;
		СтрокаРоли.ПредставлениеРоли = Роль.Синоним;
		
		СтрокаРоли.Включено = Пользователь.Роли.Содержит(Роль);
		
	КонецЦикла;
	
КонецПроцедуры 

Процедура ПередЗаписью(Отказ)

	Пользавтьель = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
	
	Если Пользавтьель = Неопределено Тогда
		Пользавтьель = ПользователиИнформационнойБазы.СоздатьПользователя();
		Пользавтьель.Имя = Наименование;
		Пользавтьель.ПолноеИмя = ПолноеИмя;
	КонецЕсли;	

	Пользавтьель.Роли.Очистить();
	НайденныеСтроки = СписокПрав.НайтиСтроки(Новый Структура("Включено", Истина));
	
	Для Каждого ТекущаяРоль Из НайденныеСтроки Цикл
		
		Пользавтьель.Роли.Добавить(Метаданные.Роли.Найти(ТекущаяРоль.ИмяРоли));
				
	КонецЦикла;
	
	Пользавтьель.Записать();
	

КонецПроцедуры
